In [3]:
import pandas as pd
import numpy as np

1. Write a Pandas program to get the powers of an array values element-wise.

In [86]:
df_t = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df_t)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

2.Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [87]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

3.Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [88]:
print("Summary of the basic information about this DataFrame and its data:")
df.info()

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

4. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [89]:
print(df.iloc[:3])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

5.Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [90]:
df.loc[:,['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [91]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

6. Write a Pandas program to select the specified columns and rows from a given DataFrame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [92]:
df.iloc[[1,3,5,6],[0,1]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [93]:
df[df.attempts>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [94]:
total_rows=len(df.axes[0])
total_cols=len(df.axes[1])
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

Number of Rows: 10
Number of Columns: 4

9.Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [95]:
df.isnull()

    name  score  attempts  qualify
a  False  False     False    False
b  False  False     False    False
c  False  False     False    False
d  False   True     False    False
e  False  False     False    False
f  False  False     False    False
g  False  False     False    False
h  False   True     False    False
i  False  False     False    False
j  False  False     False    False

In [96]:
print("Rows where score is missing:\n")

print(df[df['score'].isnull()])

Rows where score is missing:

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

10.Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [97]:
#Method -1
print("Rows where score between 15 and 20 (inclusive):\n")
print(df[df['score'].between(15, 20)])

Rows where score between 15 and 20 (inclusive):

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [98]:
#Method -2 
print("Rows where score between 15 and 20 (inclusive):\n")
new_df = df[(df['score'] >= 15) & (df['score'] <= 20)]
new_df

Rows where score between 15 and 20 (inclusive):

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [99]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [100]:
print(df[(df['attempts']<2) & (df['score']>15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

12. Write a Pandas program to change the score in row 'd' to 11.5.

In [101]:
change_df = df
change_df.loc['d','score'] = 11.5
change_df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

13. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [102]:
print("\nSum of the examination attempts by the students:")
print(df['attempts'].sum())

Sum of the examination attempts by the students:
19

In [103]:
#14. Write a Pandas program to calculate the mean score for each different student in data frame.
print("\nMean score for each different student in data frame:")
print(df['score'].mean())

Mean score for each different student in data frame:
13.333333333333334

15. Write a Pandas program to append a new row 'k' to DataFrame with given values for each column. Now delete the new row and return the original data frame.

In [104]:
print("\nAppend a new row:")
df.loc['k'] = [1, 'Suresh', 'yes', 15.5]
print("Print all records after insert a new record:")
print(df)

Append a new row:
Print all records after insert a new record:
        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima       9        3      no
c  Katherine    16.5        2     yes
d      James    11.5        3      no
e      Emily       9        2      no
f    Michael      20        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin       8        2      no
j      Jonas      19        1     yes
k          1  Suresh      yes    15.5

In [105]:
print("\nDelete the new row and display the original  rows:")
df = df.drop('k')
print(df)

Delete the new row and display the original  rows:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily     9        2      no
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
j      Jonas    19        1     yes

16. Write a Pandas program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

In [106]:
df.sort_values(by=['name', 'score'], ascending=[False, True])
print("Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:")
print(df)

Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily     9        2      no
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
j      Jonas    19        1     yes

17.Write a Pandas program to replace the ‘qualify' column contains the values 'yes' and 'no' with True and False.

In [107]:
print("\nReplace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:
        name score attempts  qualify
a  Anastasia  12.5        1     True
b       Dima     9        3    False
c  Katherine  16.5        2     True
d      James  11.5        3    False
e      Emily     9        2    False
f    Michael    20        3     True
g    Matthew  14.5        1     True
h      Laura   NaN        1    False
i      Kevin     8        2    False
j      Jonas    19        1     True

18.Write a Pandas program to change the name 'James' to 'Suresh' in name column of the data frame.

In [108]:
df['name'] = df['name'].replace('James', 'Suresh')
print(df)

        name score attempts  qualify
a  Anastasia  12.5        1     True
b       Dima     9        3    False
c  Katherine  16.5        2     True
d     Suresh  11.5        3    False
e      Emily     9        2    False
f    Michael    20        3     True
g    Matthew  14.5        1     True
h      Laura   NaN        1    False
i      Kevin     8        2    False
j      Jonas    19        1     True

19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [109]:
print("\nDelete the 'attempts' column from the data frame:\n")
df.pop('attempts')
print(df)

Delete the 'attempts' column from the data frame:

        name score  qualify
a  Anastasia  12.5     True
b       Dima     9    False
c  Katherine  16.5     True
d     Suresh  11.5    False
e      Emily     9    False
f    Michael    20     True
g    Matthew  14.5     True
h      Laura   NaN    False
i      Kevin     8    False
j      Jonas    19     True

20. Write a Pandas program to insert a new column in existing DataFrame.

In [110]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
print("\nNew DataFrame after inserting the 'color' column\n")
print(df)

New DataFrame after inserting the 'color' column

        name score  qualify   color
a  Anastasia  12.5     True     Red
b       Dima     9    False    Blue
c  Katherine  16.5     True  Orange
d     Suresh  11.5    False     Red
e      Emily     9    False   White
f    Michael    20     True   White
g    Matthew  14.5     True    Blue
h      Laura   NaN    False   Green
i      Kevin     8    False   Green
j      Jonas    19     True     Red

21. Write a Pandas program to iterate over rows in a DataFrame.

In [111]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df1 = pd.DataFrame(exam_data)
for index, row in df1.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

22.Write a Pandas program to get list from DataFrame column headers.

In [112]:
print(list(df.columns.values))

['name', 'score', 'qualify', 'color']

23.Write a Pandas program to rename columns of a given DataFrame.

In [113]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df_s = pd.DataFrame(data=d)
print("Original DataFrame")
print(df_s)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [114]:
df_s.columns = ['Column1', 'Column2', 'Column3']
df_s = df_s.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
print("New DataFrame after renaming columns:")
print(df_s)

New DataFrame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

24.Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [115]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

print('Rows for colum1 value == 4')
print(df.loc[df['col1'] == 4])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for colum1 value == 4
   col1  col2  col3
1     4     5     8
3     4     7     0

25. Write a Pandas program to change the order of a DataFrame columns.

In [116]:
df = df[['col3', 'col2', 'col1']]
print(df)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

26. Write a Pandas program to add one row in an existing DataFrame.

In [117]:
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df = df.append(df2, ignore_index=True)
print(df)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5
5    12    11    10